Update ReadmeCodeOptimization.md
emojis have been corrected
